Revit 2027 API
RebarBarType.SetHookPermission Method
 Identifies if a hook type is permitted for this bar type
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetHookPermission(
	ElementId hookId,
	bool permission
)
Public Sub SetHookPermission (
	hookId As ElementId,
	permission As Boolean
)
public:
void SetHookPermission(
	ElementId^ hookId,
	bool permission
)
member SetHookPermission :
        hookId : ElementId *
        permission : bool -> unit
Parameters
hookId ElementId
 id of the hook type
permission Boolean
 True if the hook type should be permitted for this bar type, otherwise false
Exceptions
Exception | Condition
ArgumentException |  the rebar hook type id hookId is not valid
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace